### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_namespace.onp_discord_bot will be created
+   resource "kubernetes_namespace" "onp_discord_bot" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "discord-bot"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_discord_bot_discord_spam_reporter_secrets will be created
+   resource "kubernetes_secret" "onp_discord_bot_discord_spam_reporter_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "discord-bot--discord-spam-reporter--config-secrets"
+           namespace        = "discord-bot"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>